app/controllers/api/v1/courses_controller.rb

SELECT "courses".* FROM "courses"
---
      def index
        render json: Course.all

INSERT INTO "courses" ("title", "description", "category", "duration", "photo", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "courses_users" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 20], ["course_id", 229], ["created_at", "2022-05-12 16:41:17.447165"], ["updated_at", "2022-05-12 16:41:17.447165"]]
---
      def create
        data = json_payload.select { |k| ALLOWED_DATA.include?(k) }
        courses = Course.new(data)
        # courses.update(user: current_user)

        if courses.save
          courses_users = User.find(courses.user_id)
          CoursesUser.create(course: courses, user: courses_users)

SELECT "courses_users".* FROM "courses_users" WHERE "courses_users"."course_id" = $1  [["course_id", 228]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 228]]
DELETE FROM "courses_users" WHERE "courses_users"."id" = $1  [["id", 11]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 228], ["LIMIT", 1]]
---
      def destroy
        var = CoursesUser.where(course_id: params[:id])
        var.destroy_all
        Course.find(params[:id]).destroy!