app/controllers/api/v1/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."course_id" = $1  [["course_id", 20]]
---
      def index
        render json: Reservation.where(course_id: Course.find(params[:course_id]).id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "reservations" ("reserve_date", "duration", "user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reserve_date", "one day"], ["duration", 5], ["user_id", 4], ["course_id", 3], ["created_at", "2022-05-12 16:27:08.121772"], ["updated_at", "2022-05-12 16:27:08.121772"]]
---
      def create
        courses = Course.find(params[:course_id])
        current_user = User.find(course.user_id)
        data = json_payload.select { |k| ALLOWED_DATA > include?(k) }
        reservation = Reservation.new(data)
        reservation.update(user: current_user, course: courses)

        if reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 62]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
---
      def destroy
        Reservation.find(params[:id]).destroy!